﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2015, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**         5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093     **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************

/** @file Acoustic.uni
    Acoustic support Configure Form String Definitions

**/

//---------------------------------------------------------------------------

#include "VFR.uni"

//---------------------------------------------------------------------------

#langdef   x-AMI "x-AMI"    // AMI Configuration Language

//
//Hdd Acoustics
//

#string STR_SATA_ACOUSTIC_OPTIONS_FORM_TITLE    #language eng "Global Acoustic Configuration"

#string STR_ACOUSTIC_SUBTITLE                   #language eng "Acoustic Management Configuration"
#string STR_ACOUSTIC_SUBTITLE_HELP              #language eng "Menu for configuring Automatic Acoustic Management"
#string STR_AUTO_ACOUSTIC                       #language eng "Automatic Acoustic Management"
                                                #language x-AMI "ACOU000"
#string STR_AUTO_ACOUSTIC_HELP                  #language eng "Option to Enable or Disable Automatic Acoustic Management"

#string STR_AUTO_ACOUSTIC_MODE                  #language eng "Acoustic Mode"
                                                #language x-AMI "ACOU001"
#string STR_AUTO_ACOUSTIC_MODE_INDV             #language eng "  Acoustic Mode"
                                                #language x-AMI "ACOU002"
#string STR_AUTO_ACOUSTIC_MODE_HELP             #language eng "Option to optimize the Storage Device Performance and Acoustic Noise Level \n\n Bypass - Use Drive's Preset Value \n Quiet - Drive is Slower, But Quieter \n Max Performance - Drive is Faster, but possibly Noisier"
#string STR_BYPASS_STRING                       #language eng "Bypass"
#string STR_QUIET_STRING                        #language eng "Quiet"
#string STR_MAXIMUM_PERFORMANCE_STRING          #language eng "Max Performance"

#string STR_SUPPORTED                           #language eng "Supported"
#string STR_NOT_SUPPORTED                       #language eng "Not Supported"
#string STR_NOT_AVAILABLE                       #language eng "Not Available"

#string STR_ENABLED_STRING                      #language eng "Enabled"
#string STR_DISABLED_STRING                     #language eng "Disabled"
//
// Porting required
//

// Add more strings if there are more than 3 controllers

#string STR_ACOUSTIC_SATA0_SETTINGS           #language eng "SATA Controller 0"
#string STR_ACOUSTIC_SATA1_SETTINGS           #language eng "SATA Controller 1"
#string STR_ACOUSTIC_SATA2_SETTINGS           #language eng "SATA Controller 2"

#string STR_ACOUSTIC_SATA_PORT0               #language eng "Port 0"
#string STR_ACOUSTIC_SATA_PORT1               #language eng "Port 1"
#string STR_ACOUSTIC_SATA_PORT2               #language eng "Port 2"
#string STR_ACOUSTIC_SATA_PORT3               #language eng "Port 3"
#string STR_ACOUSTIC_SATA_PORT4               #language eng "Port 4"
#string STR_ACOUSTIC_SATA_PORT5               #language eng "Port 5"

// Add more strings if there are more than 18 SATA ports

#string STR_ACOUSTIC_SATA0_PORT0_DEVICE_NAME                        #language eng "Port is Empty"
#string STR_ACOUSTIC_SATA0_PORT1_DEVICE_NAME                        #language eng "Port is Empty"
#string STR_ACOUSTIC_SATA0_PORT2_DEVICE_NAME                        #language eng "Port is Empty"
#string STR_ACOUSTIC_SATA0_PORT3_DEVICE_NAME                        #language eng "Port is Empty"
#string STR_ACOUSTIC_SATA0_PORT4_DEVICE_NAME                        #language eng "Port is Empty"
#string STR_ACOUSTIC_SATA0_PORT5_DEVICE_NAME                        #language eng "Port is Empty"

#string STR_ACOUSTIC_SATA1_PORT0_DEVICE_NAME                        #language eng "Port is Empty"
#string STR_ACOUSTIC_SATA1_PORT1_DEVICE_NAME                        #language eng "Port is Empty"
#string STR_ACOUSTIC_SATA1_PORT2_DEVICE_NAME                        #language eng "Port is Empty"
#string STR_ACOUSTIC_SATA1_PORT3_DEVICE_NAME                        #language eng "Port is Empty"
#string STR_ACOUSTIC_SATA1_PORT4_DEVICE_NAME                        #language eng "Port is Empty"
#string STR_ACOUSTIC_SATA1_PORT5_DEVICE_NAME                        #language eng "Port is Empty"

#string STR_ACOUSTIC_SATA2_PORT0_DEVICE_NAME                        #language eng "Port is Empty"
#string STR_ACOUSTIC_SATA2_PORT1_DEVICE_NAME                        #language eng "Port is Empty"
#string STR_ACOUSTIC_SATA2_PORT2_DEVICE_NAME                        #language eng "Port is Empty"
#string STR_ACOUSTIC_SATA2_PORT3_DEVICE_NAME                        #language eng "Port is Empty"
#string STR_ACOUSTIC_SATA2_PORT4_DEVICE_NAME                        #language eng "Port is Empty"
#string STR_ACOUSTIC_SATA2_PORT5_DEVICE_NAME                        #language eng "Port is Empty"

#string STR_HDD_NOT_FOUND                                           #language eng "Hdd not found"

//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2015, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**         5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093     **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************
